---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DeleteWorksetSettings
source: html/d97c0550-06ff-73ec-361c-9e0ec1dbe310.htm
---
# DeleteWorksetSettings Members

Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.